In [115]:
print('hello world ')

hello world

In [116]:
import numpy as np
import pandas as pd

In [117]:
dict1={
    "name":['harry','rohan','shawon'],
    "marks":[92,34,24],
    "city":['rampur','kolkata','new york',]
}

In [118]:
df=pd.DataFrame(dict1)
#its use to basically analyze big data 
#it covert in data frame in

In [119]:
df

     name  marks      city
0   harry     92    rampur
1   rohan     34   kolkata
2  shawon     24  new york

In [120]:
###covert in csv this data frame

In [121]:
df.to_csv('friends.csv')
#it create a excel shit in this data frame which is given on the index
#with index and column give it 
#it also include index

In [122]:
#we can see without index
df.to_csv('friends_index_false.csv',index=False)

In [123]:
#if the data is so big 
#if we want to see only first 2 row 
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [124]:
#if we want to see 2nd two row
df.tail(2)

     name  marks      city
1   rohan     34   kolkata
2  shawon     24  new york

In [125]:
df.describe()#details tells us about this csv

          marks
count   3.00000
mean   50.00000
std    36.71512
min    24.00000
25%    29.00000
50%    34.00000
75%    63.00000
max    92.00000

In [126]:
arman=pd.read_csv('arman.csv')#creat a new csv file which is read in 
#this method
arman

,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,location,city,country
0,0,0,0,0,gazipur,usa,Bangladesh
1,1,1,1,1,newmarket,nilkhet,dhaka
2,2,2,2,2,uttara,azompur,dhaka

In [127]:
arman['location']#we only see the location

0      gazipur
1    newmarket
2       uttara
Name: location, dtype: object

In [128]:
#change specific  value in this 
arman['city'][0]='usa'
arman

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_22296\2052056910.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  arman['city'][0]='usa'
C:\Users\Lenovo\AppData\Local\Temp\ipykernel_22296\2052056910.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  arman['city'][0]='usa'

,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,location,city,country
0,0,0,0,0,gazipur,usa,Bangladesh
1,1,1,1,1,newmarket,nilkhet,dhaka
2,2,2,2,2,uttara,azompur,dhaka

In [129]:
#in this above code 0 index we change the city name 
#Dhaka to usa we want to save this modify in arman.csv file 
arman.to_csv('arman.csv')

In [130]:
#series and dataframe
ser=pd.Series(np.random.rand(34))
#it gives us a series 0 to 34

In [131]:
ser

0     0.656099
1     0.360300
2     0.352848
3     0.494371
4     0.272289
5     0.270767
6     0.580261
7     0.145831
8     0.931712
9     0.217181
10    0.434952
11    0.596383
12    0.759343
13    0.231783
14    0.929495
15    0.826967
16    0.714578
17    0.491637
18    0.561123
19    0.515553
20    0.522452
21    0.865763
22    0.272654
23    0.800016
24    0.638815
25    0.554428
26    0.335444
27    0.762835
28    0.130830
29    0.451893
30    0.081264
31    0.156393
32    0.374091
33    0.756685
dtype: float64

In [132]:
type(ser)#its a series 
#its a data structure in pandas

pandas.core.series.Series

In [133]:
#create a dataframe 
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))
newdf.head()
#without head()it print all dataframe which has 334 rows and 5 column
newdf

            0         1         2         3         4
0    0.504681  0.003871  0.129654  0.279501  0.275744
1    0.449270  0.694791  0.808291  0.878572  0.588621
2    0.049882  0.247535  0.303947  0.972907  0.659121
3    0.466174  0.445829  0.474273  0.593539  0.576727
4    0.777315  0.206539  0.115887  0.375953  0.468557
..        ...       ...       ...       ...       ...
329  0.529373  0.449008  0.446875  0.518118  0.300793
330  0.666505  0.435087  0.905169  0.532986  0.051600
331  0.336873  0.407902  0.781789  0.791020  0.254719
332  0.576978  0.032724  0.756370  0.574450  0.730353
333  0.830897  0.459673  0.551651  0.268130  0.479403

[334 rows x 5 columns]

In [134]:
type(newdf)#return me the dataframe

pandas.core.frame.DataFrame

In [135]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.491464    0.482040    0.497145    0.497786    0.499845
std      0.281472    0.294938    0.283642    0.292260    0.301460
min      0.005430    0.002538    0.001102    0.001573    0.000459
25%      0.250540    0.233144    0.270300    0.259367    0.229746
50%      0.485808    0.465650    0.481776    0.485496    0.503230
75%      0.733645    0.734193    0.737088    0.733921    0.764001
max      0.999690    0.998873    0.996766    0.995662    0.998473

In [136]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [137]:
newdf.head()

          0         1         2         3         4
0  0.504681  0.003871  0.129654  0.279501  0.275744
1  0.449270  0.694791  0.808291  0.878572  0.588621
2  0.049882  0.247535  0.303947  0.972907  0.659121
3  0.466174  0.445829  0.474273  0.593539  0.576727
4  0.777315  0.206539  0.115887  0.375953  0.468557

In [138]:
newdf[0][0]="arman"#it show us that [0][0] is an object
newdf.dtypes

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_22296\3496854330.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0]="arman"#it show us that [0][0] is an object
C:\Users\Lenovo\AppData\Local\Temp\ipykernel_22296\3496854330.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'arman' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]="arman"#it show us that [0][0] is an object

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [139]:
newdf.head()#it show[0][0] is arman

          0         1         2         3         4
0     arman  0.003871  0.129654  0.279501  0.275744
1   0.44927  0.694791  0.808291  0.878572  0.588621
2  0.049882  0.247535  0.303947  0.972907  0.659121
3  0.466174  0.445829  0.474273  0.593539  0.576727
4  0.777315  0.206539  0.115887  0.375953  0.468557

In [140]:
newdf.index#our data table is 0 to 334 so it show the all index 
#0 to 334

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [141]:
newdf.columns#it show the column number only

RangeIndex(start=0, stop=5, step=1)

In [142]:
#covert this dataframe in numpy array
newdf.to_numpy#create this into numpy

<bound method DataFrame.to_numpy of             0         1         2         3         4
0       arman  0.003871  0.129654  0.279501  0.275744
1     0.44927  0.694791  0.808291  0.878572  0.588621
2    0.049882  0.247535  0.303947  0.972907  0.659121
3    0.466174  0.445829  0.474273  0.593539  0.576727
4    0.777315  0.206539  0.115887  0.375953  0.468557
..        ...       ...       ...       ...       ...
329  0.529373  0.449008  0.446875  0.518118  0.300793
330  0.666505  0.435087  0.905169  0.532986  0.051600
331  0.336873  0.407902  0.781789  0.791020  0.254719
332  0.576978  0.032724  0.756370  0.574450  0.730353
333  0.830897  0.459673  0.551651  0.268130  0.479403

[334 rows x 5 columns]>

In [143]:
newdf[0][0]=0.3#above show it arman but we change that
newdf.head

<bound method NDFrame.head of             0         1         2         3         4
0         0.3  0.003871  0.129654  0.279501  0.275744
1     0.44927  0.694791  0.808291  0.878572  0.588621
2    0.049882  0.247535  0.303947  0.972907  0.659121
3    0.466174  0.445829  0.474273  0.593539  0.576727
4    0.777315  0.206539  0.115887  0.375953  0.468557
..        ...       ...       ...       ...       ...
329  0.529373  0.449008  0.446875  0.518118  0.300793
330  0.666505  0.435087  0.905169  0.532986  0.051600
331  0.336873  0.407902  0.781789  0.791020  0.254719
332  0.576978  0.032724  0.756370  0.574450  0.730353
333  0.830897  0.459673  0.551651  0.268130  0.479403

[334 rows x 5 columns]>

In [144]:
newdf.T#it turns row into columns and colmuns turns ito row

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.44927,0.049882,0.466174,0.777315,0.353942,0.741454,0.910263,0.156182,0.752995,...,0.099202,0.329938,0.380843,0.423013,0.332004,0.529373,0.666505,0.336873,0.576978,0.830897
1,0.003871,0.694791,0.247535,0.445829,0.206539,0.205924,0.064969,0.965705,0.034622,0.878845,...,0.146586,0.310924,0.020286,0.477311,0.00254,0.449008,0.435087,0.407902,0.032724,0.459673
2,0.129654,0.808291,0.303947,0.474273,0.115887,0.911059,0.732661,0.891044,0.082503,0.973094,...,0.767471,0.644395,0.502645,0.056225,0.666242,0.446875,0.905169,0.781789,0.75637,0.551651
3,0.279501,0.878572,0.972907,0.593539,0.375953,0.507073,0.065347,0.305067,0.384019,0.865534,...,0.23183,0.553288,0.586843,0.101762,0.783504,0.518118,0.532986,0.79102,0.57445,0.26813
4,0.275744,0.588621,0.659121,0.576727,0.468557,0.763829,0.281079,0.347053,0.764392,0.365082,...,0.792932,0.544595,0.953156,0.13578,0.521644,0.300793,0.0516,0.254719,0.730353,0.479403

In [145]:
#sort
newdf.head()

          0         1         2         3         4
0       0.3  0.003871  0.129654  0.279501  0.275744
1   0.44927  0.694791  0.808291  0.878572  0.588621
2  0.049882  0.247535  0.303947  0.972907  0.659121
3  0.466174  0.445829  0.474273  0.593539  0.576727
4  0.777315  0.206539  0.115887  0.375953  0.468557

In [146]:
#but we want to sort as index #axis=0 means it rows#ulta kore print korte means last index is first

newdf.sort_index(axis=0,ascending=False)

            0         1         2         3         4
333  0.830897  0.459673  0.551651  0.268130  0.479403
332  0.576978  0.032724  0.756370  0.574450  0.730353
331  0.336873  0.407902  0.781789  0.791020  0.254719
330  0.666505  0.435087  0.905169  0.532986  0.051600
329  0.529373  0.449008  0.446875  0.518118  0.300793
..        ...       ...       ...       ...       ...
4    0.777315  0.206539  0.115887  0.375953  0.468557
3    0.466174  0.445829  0.474273  0.593539  0.576727
2    0.049882  0.247535  0.303947  0.972907  0.659121
1     0.44927  0.694791  0.808291  0.878572  0.588621
0         0.3  0.003871  0.129654  0.279501  0.275744

[334 rows x 5 columns]

In [147]:
newdf.sort_index(axis=0,ascending=True)#its correct way to print#
#axis=0 it means row,axis=1 means it column

            0         1         2         3         4
0         0.3  0.003871  0.129654  0.279501  0.275744
1     0.44927  0.694791  0.808291  0.878572  0.588621
2    0.049882  0.247535  0.303947  0.972907  0.659121
3    0.466174  0.445829  0.474273  0.593539  0.576727
4    0.777315  0.206539  0.115887  0.375953  0.468557
..        ...       ...       ...       ...       ...
329  0.529373  0.449008  0.446875  0.518118  0.300793
330  0.666505  0.435087  0.905169  0.532986  0.051600
331  0.336873  0.407902  0.781789  0.791020  0.254719
332  0.576978  0.032724  0.756370  0.574450  0.730353
333  0.830897  0.459673  0.551651  0.268130  0.479403

[334 rows x 5 columns]

In [148]:
newdf.head()

          0         1         2         3         4
0       0.3  0.003871  0.129654  0.279501  0.275744
1   0.44927  0.694791  0.808291  0.878572  0.588621
2  0.049882  0.247535  0.303947  0.972907  0.659121
3  0.466174  0.445829  0.474273  0.593539  0.576727
4  0.777315  0.206539  0.115887  0.375953  0.468557

In [149]:
newdf[0]

0           0.3
1       0.44927
2      0.049882
3      0.466174
4      0.777315
         ...
329    0.529373
330    0.666505
331    0.336873
332    0.576978
333    0.830897
Name: 0, Length: 334, dtype: object

In [150]:
#we want to see this type it a series
type(newdf[0])

pandas.core.series.Series

In [151]:
newdf.head

<bound method NDFrame.head of             0         1         2         3         4
0         0.3  0.003871  0.129654  0.279501  0.275744
1     0.44927  0.694791  0.808291  0.878572  0.588621
2    0.049882  0.247535  0.303947  0.972907  0.659121
3    0.466174  0.445829  0.474273  0.593539  0.576727
4    0.777315  0.206539  0.115887  0.375953  0.468557
..        ...       ...       ...       ...       ...
329  0.529373  0.449008  0.446875  0.518118  0.300793
330  0.666505  0.435087  0.905169  0.532986  0.051600
331  0.336873  0.407902  0.781789  0.791020  0.254719
332  0.576978  0.032724  0.756370  0.574450  0.730353
333  0.830897  0.459673  0.551651  0.268130  0.479403

[334 rows x 5 columns]>

In [152]:
newdf2=newdf # it not copy it only poiter this numpy on newdf2 variable
newdf2

            0         1         2         3         4
0         0.3  0.003871  0.129654  0.279501  0.275744
1     0.44927  0.694791  0.808291  0.878572  0.588621
2    0.049882  0.247535  0.303947  0.972907  0.659121
3    0.466174  0.445829  0.474273  0.593539  0.576727
4    0.777315  0.206539  0.115887  0.375953  0.468557
..        ...       ...       ...       ...       ...
329  0.529373  0.449008  0.446875  0.518118  0.300793
330  0.666505  0.435087  0.905169  0.532986  0.051600
331  0.336873  0.407902  0.781789  0.791020  0.254719
332  0.576978  0.032724  0.756370  0.574450  0.730353
333  0.830897  0.459673  0.551651  0.268130  0.479403

[334 rows x 5 columns]

In [153]:
#value set in a specific index
newdf.loc[0,0]=654
newdf.head

<bound method NDFrame.head of             0         1         2         3         4
0         654  0.003871  0.129654  0.279501  0.275744
1     0.44927  0.694791  0.808291  0.878572  0.588621
2    0.049882  0.247535  0.303947  0.972907  0.659121
3    0.466174  0.445829  0.474273  0.593539  0.576727
4    0.777315  0.206539  0.115887  0.375953  0.468557
..        ...       ...       ...       ...       ...
329  0.529373  0.449008  0.446875  0.518118  0.300793
330  0.666505  0.435087  0.905169  0.532986  0.051600
331  0.336873  0.407902  0.781789  0.791020  0.254719
332  0.576978  0.032724  0.756370  0.574450  0.730353
333  0.830897  0.459673  0.551651  0.268130  0.479403

[334 rows x 5 columns]>

In [154]:
#create a new numpy using a pandas method dataframe
newdf2=newdf.copy()
newdf2[0][0]=97835
newdf

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_22296\2229203358.py:3: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][0]=97835
C:\Users\Lenovo\AppData\Local\Temp\ipykernel_22296\2229203358.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0]=97835

            0         1         2         3         4
0         654  0.003871  0.129654  0.279501  0.275744
1     0.44927  0.694791  0.808291  0.878572  0.588621
2    0.049882  0.247535  0.303947  0.972907  0.659121
3    0.466174  0.445829  0.474273  0.593539  0.576727
4    0.777315  0.206539  0.115887  0.375953  0.468557
..        ...       ...       ...       ...       ...
329  0.529373  0.449008  0.446875  0.518118  0.300793
330  0.666505  0.435087  0.905169  0.532986  0.051600
331  0.336873  0.407902  0.781789  0.791020  0.254719
332  0.576978  0.032724  0.756370  0.574450  0.730353
333  0.830897  0.459673  0.551651  0.268130  0.479403

[334 rows x 5 columns]

In [155]:
newdf2.head#print new df

<bound method NDFrame.head of             0         1         2         3         4
0       97835  0.003871  0.129654  0.279501  0.275744
1     0.44927  0.694791  0.808291  0.878572  0.588621
2    0.049882  0.247535  0.303947  0.972907  0.659121
3    0.466174  0.445829  0.474273  0.593539  0.576727
4    0.777315  0.206539  0.115887  0.375953  0.468557
..        ...       ...       ...       ...       ...
329  0.529373  0.449008  0.446875  0.518118  0.300793
330  0.666505  0.435087  0.905169  0.532986  0.051600
331  0.336873  0.407902  0.781789  0.791020  0.254719
332  0.576978  0.032724  0.756370  0.574450  0.730353
333  0.830897  0.459673  0.551651  0.268130  0.479403

[334 rows x 5 columns]>

In [156]:
newdf.loc[0,0]=654#0,0 position is 654
newdf.head(2)#show 2 column and row

         0         1         2         3         4
0      654  0.003871  0.129654  0.279501  0.275744
1  0.44927  0.694791  0.808291  0.878572  0.588621

In [157]:
newdf.columns= list("ABCDE")
newdf# column name is A B C D E

            A         B         C         D         E
0         654  0.003871  0.129654  0.279501  0.275744
1     0.44927  0.694791  0.808291  0.878572  0.588621
2    0.049882  0.247535  0.303947  0.972907  0.659121
3    0.466174  0.445829  0.474273  0.593539  0.576727
4    0.777315  0.206539  0.115887  0.375953  0.468557
..        ...       ...       ...       ...       ...
329  0.529373  0.449008  0.446875  0.518118  0.300793
330  0.666505  0.435087  0.905169  0.532986  0.051600
331  0.336873  0.407902  0.781789  0.791020  0.254719
332  0.576978  0.032724  0.756370  0.574450  0.730353
333  0.830897  0.459673  0.551651  0.268130  0.479403

[334 rows x 5 columns]

In [158]:
newdf.head(2)

         A         B         C         D         E
0      654  0.003871  0.129654  0.279501  0.275744
1  0.44927  0.694791  0.808291  0.878572  0.588621

In [159]:
newdf.loc[0,0]=654
newdf.head#it returns D first 654 and another value is nan nan nan
#but we want to do this

<bound method NDFrame.head of             A         B         C         D         E      0
0         654  0.003871  0.129654  0.279501  0.275744  654.0
1     0.44927  0.694791  0.808291  0.878572  0.588621    NaN
2    0.049882  0.247535  0.303947  0.972907  0.659121    NaN
3    0.466174  0.445829  0.474273  0.593539  0.576727    NaN
4    0.777315  0.206539  0.115887  0.375953  0.468557    NaN
..        ...       ...       ...       ...       ...    ...
329  0.529373  0.449008  0.446875  0.518118  0.300793    NaN
330  0.666505  0.435087  0.905169  0.532986  0.051600    NaN
331  0.336873  0.407902  0.781789  0.791020  0.254719    NaN
332  0.576978  0.032724  0.756370  0.574450  0.730353    NaN
333  0.830897  0.459673  0.551651  0.268130  0.479403    NaN

[334 rows x 6 columns]>

In [160]:
#to solve this we can write 
newdf.loc[0,'A']=65445
newdf.head()#now upgrade first value is 65445

          A         B         C         D         E      0
0     65445  0.003871  0.129654  0.279501  0.275744  654.0
1   0.44927  0.694791  0.808291  0.878572  0.588621    NaN
2  0.049882  0.247535  0.303947  0.972907  0.659121    NaN
3  0.466174  0.445829  0.474273  0.593539  0.576727    NaN
4  0.777315  0.206539  0.115887  0.375953  0.468557    NaN

In [161]:
#in above we want to drop last 0 column
newdf.drop(0,axis=1)
#axis 1 means column and axis 0 means is row

            A         B         C         D         E
0       65445  0.003871  0.129654  0.279501  0.275744
1     0.44927  0.694791  0.808291  0.878572  0.588621
2    0.049882  0.247535  0.303947  0.972907  0.659121
3    0.466174  0.445829  0.474273  0.593539  0.576727
4    0.777315  0.206539  0.115887  0.375953  0.468557
..        ...       ...       ...       ...       ...
329  0.529373  0.449008  0.446875  0.518118  0.300793
330  0.666505  0.435087  0.905169  0.532986  0.051600
331  0.336873  0.407902  0.781789  0.791020  0.254719
332  0.576978  0.032724  0.756370  0.574450  0.730353
333  0.830897  0.459673  0.551651  0.268130  0.479403

[334 rows x 5 columns]

In [162]:
newdf= newdf.drop(0,axis=1)
newdf.head()

          A         B         C         D         E
0     65445  0.003871  0.129654  0.279501  0.275744
1   0.44927  0.694791  0.808291  0.878572  0.588621
2  0.049882  0.247535  0.303947  0.972907  0.659121
3  0.466174  0.445829  0.474273  0.593539  0.576727
4  0.777315  0.206539  0.115887  0.375953  0.468557

In [165]:
#we want to demand set of column
newdf.loc[[1,2],['C','D']]
#1,2 row and c,D columns

          C         D
1  0.808291  0.878572
2  0.303947  0.972907

In [168]:
newdf.loc[[1,2], :]#it show 1 and 2 row and all column

          A         B         C         D         E
1   0.44927  0.694791  0.808291  0.878572  0.588621
2  0.049882  0.247535  0.303947  0.972907  0.659121